res/requests/soap-request-9.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:ns7970="http://tempuri.org">
<SOAP-ENV:Body>
<IDSP:RunScript xmlns:IDSP="http://ns.adobe.com/InDesign/soap/">
<runScriptParameters>
	<scriptText></scriptText>
      <scriptLanguage>javascript</scriptLanguage>
      <scriptFile>REQUEST</scriptFile>
      
      
      <scriptArgs>
      	<name>script1</name>
      	<value><![CDATA[/Users/ppowalla/ContentServ/CS13/admin//modules/indesign/server/jsx/eval.jsx|%2FUsers%2Fppowalla%2FContentServ%2FCS13%2Fadmin%2F%2F..%2FCSLive%2Fvolumes%2FPublications%2FCSLive.Cover.indd|%0A%20%20%20%20%20%20%20%20try%7B%0A%20%20%20%20%20%20%20%20%20%20xmlRuleElement%20%3D%20myDoc.xmlElements.firstItem%28%29.xmlElements.item%28%27ICMRules%27%29%3B%0A%20%20%20%20%20%20%20%20%20%20writeLocalXmlFile%28xmlRuleElement.contents%29%3B%0A%20%20%20%20%20%20%20%20%7D%0A%20%20%20%20%20%20%20%20catch%28e%29%7B%0A%20%20%20%20%20%20%20%20%20%20%27%27%3B%0A%20%20%20%20%20%20%20%20%7D%0A%20%20%20%20%20%20]]></value>
      </scriptArgs>
      <scriptArgs>
      	<name>visibleObjects</name>
      	<value><![CDATA[textframe;image;note;rectangle;group;polygon;oval]]></value>
      </scriptArgs>
      <scriptArgs>
      	<name>projectCacheDir</name>
      	<value><![CDATA[/Users/ppowalla/ContentServ/CS13/admin//../CSLive/data//cache/indesign/1474/]]></value>
      </scriptArgs>
      <scriptArgs>
      	<name>globalCacheDir</name>
      	<value><![CDATA[/Users/ppowalla/ContentServ/CS13/admin//../CSLive/data//cache/indesign]]></value>
      </scriptArgs>
      <scriptArgs>
      	<name>CurrentConnectionIndex</name>
      	<value><![CDATA[e921a]]></value>
      </scriptArgs>
      
      <scriptArgs>
      	<name>CurrentAdminPath</name>
      	<value><![CDATA[/Users/ppowalla/ContentServ/CS13/admin/]]></value>
      </scriptArgs>
      
      <scriptArgs>
      	<name>CurrentProjectPath</name>
      	<value><![CDATA[/Users/ppowalla/ContentServ/CS13/CSLive]]></value>
      </scriptArgs>
      
      <scriptArgs>
      	<name>CurrentMamID</name>
      	<value><![CDATA[9]]></value>
      </scriptArgs>
      
      <scriptArgs>
      	<name>CurrentUserID</name>
      	<value><![CDATA[2]]></value>
      </scriptArgs>
      
      <scriptArgs>
      	<name>CurrentSessionContext</name>
      	<value><![CDATA[]]></value>
      </scriptArgs>
      <scriptArgs>
      	<name>CurrentProcessID</name>
      	<value><![CDATA[772gpibc4m86b7tm68gpmaq1s5]]></value>
      </scriptArgs>
      
      <scriptArgs>
      	<name>CurrentView</name>
      	<value><![CDATA[page]]></value>
      </scriptArgs>
      
      <scriptArgs>
      	<name>ServerTextLinkType</name>
      	<value><![CDATA[]]></value>
      </scriptArgs>
      	
      <scriptArgs>
      	<name>IgnoreObjectVisibility</name>
      	<value><![CDATA[]]></value>
      </scriptArgs>
      
      <scriptArgs>
      	<name>cacheDeactivated</name>
      	<value><![CDATA[]]></value>
      </scriptArgs>
      
      <scriptArgs>
      	<name>memcached</name>
      	<value><![CDATA[]]></value>
      </scriptArgs>
      
      <scriptArgs>
      	<name>redis</name>
      	<value><![CDATA[]]></value>
      </scriptArgs>
      
      <scriptArgs>
      	<name>documentLocked</name>
      	<value><![CDATA[]]></value>
      </scriptArgs>
      
      <scriptArgs>
      	<name>SoapPort</name>
      	<value><![CDATA[18385]]></value>
      </scriptArgs>
      
</runScriptParameters>

</IDSP:RunScript>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
