res/requests/connect.xml

<?xml version="1.0" encoding="UTF-8"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:ns7970="http://tempuri.org"><SOAP-ENV:Body><IDSP:RunScript xmlns:IDSP="http://ns.adobe.com/InDesign/soap/"><runScriptParameters><scriptText></scriptText>
<scriptLanguage>javascript</scriptLanguage>
<scriptFile>/WEBserver/teutates/azettl/stable/admin/../admin/modules/indesign/server/jsx/run.jsx</scriptFile><scriptArgs><name>script1</name><value><![CDATA[/WEBserver/teutates/azettl/stable/admin/modules/indesign/server/jsx/eval.jsx||%0A%20%20%20%20%20%20%20%20var%20rootObject%20%3D%20myDoc%3B%0A%20%20%20%20%20%20%20%20var%20ID%20%3D%20%27-1%27%3B%0A%20%20%20%20%20%20%20%20if%28ID.match%28%2F_%2F%29%29%20var%20object%20%3D%20CSIcmTag.GetTagForID%28%27-1%27%29%3B%0A%20%20%20%20%20%20%20%20else%7B%0A%20%20%20%20%20%20%20%20%20%20try%7B%0A%20%20%20%20%20%20%20%20%20%20%20%20var%20object%20%3D%20app%3B%0A%20%20%20%20%20%20%20%20%20%20%20%20if%28%21object.isValid%29%20throw%20new%20Exception%28%27object%20not%20found%27%29%3B%0A%20%20%20%20%20%20%20%20%20%20%7D%0A%20%20%20%20%20%20%20%20%20%20catch%28e%29%7B%0A%20%20%20%20%20%20%20%20%20%20%20%20if%28parseInt%28ID%29%20%21%3D%20ID%29%20var%20object%20%3D%20app%3B%0A%20%20%20%20%20%20%20%20%20%20%20%20else%7B%0A%20%20%20%20%20%20%20%20%20%20%20%20%20%20var%20object%20%3D%20app%3B%0A%20%20%20%20%20%20%20%20%20%20%20%20%7D%0A%20%20%20%20%20%20%20%20%20%20%7D%0A%20%20%20%20%20%20%20%20%7D%0A%20%20%20%20%20%20%20%20if%28object.constructor.name.toLowerCase%28%29%20%21%3D%20%27application%27%29%20%24.error%20%3D%20%27element%20not%20found%27%3B%0A%20%20%20%20%20%20%20%20CSIcm.GetApplicationObject%28object%2C%20true%2C%202048%29%3B%0A%20%20%20%20%20%20]]></value></scriptArgs><scriptArgs><name>visibleObjects</name><value><![CDATA[textframe;image;note;rectangle;group;polygon;oval]]></value></scriptArgs><scriptArgs><name>projectCacheDir</name><value><![CDATA[/WEBserver/teutates/azettl/stable/admin/../CSLive/data//cache/indesign/1421/]]></value></scriptArgs><scriptArgs><name>globalCacheDir</name><value><![CDATA[/WEBserver/teutates/azettl/stable/admin/../CSLive/data//cache/indesign]]></value></scriptArgs><scriptArgs><name>CurrentConnectionIndex</name><value><![CDATA[5285f]]></value></scriptArgs><scriptArgs><name>CurrentAdminPath</name><value><![CDATA[/WEBserver/teutates/azettl/stable/admin]]></value></scriptArgs><scriptArgs><name>CurrentProjectPath</name><value><![CDATA[/WEBserver/teutates/azettl/stable/CSLive]]></value></scriptArgs><scriptArgs><name>CurrentMamID</name><value><![CDATA[1421]]></value></scriptArgs><scriptArgs><name>CurrentUserID</name><value><![CDATA[2]]></value></scriptArgs><scriptArgs><name>CurrentSessionContext</name><value><![CDATA[]]></value></scriptArgs><scriptArgs><name>CurrentProcessID</name><value><![CDATA[dte7o52tpsq4p82j3a6c2au3k6]]></value></scriptArgs><scriptArgs><name>CurrentView</name><value><![CDATA[page]]></value></scriptArgs><scriptArgs><name>ServerTextLinkType</name><value><![CDATA[]]></value></scriptArgs><scriptArgs><name>IgnoreObjectVisibility</name><value><![CDATA[]]></value></scriptArgs><scriptArgs><name>cacheDeactivated</name><value><![CDATA[]]></value></scriptArgs><scriptArgs><name>memcached</name><value><![CDATA[]]></value></scriptArgs><scriptArgs><name>redis</name><value><![CDATA[]]></value></scriptArgs><scriptArgs><name>documentLocked</name><value><![CDATA[]]></value></scriptArgs><scriptArgs><name>SoapPort</name><value><![CDATA[8080]]></value></scriptArgs></runScriptParameters></IDSP:RunScript></SOAP-ENV:Body></SOAP-ENV:Envelope>