res/firstcheck.txt

MultiThreadedHTTPServer started at 0.0.0.0:8080
DefaultInDesignLoadBalancerImpl.processSimpleXMLRequest() <?xml version="1.0" encoding="UTF-8"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:ns7970="http://tempuri.org"><SOAP-ENV:Body><IDSP:RunScript xmlns:IDSP="http://ns.adobe.com/InDesign/soap/"><runScriptParameters><scriptText></scriptText>
      <scriptLanguage>javascript</scriptLanguage>
      <scriptFile>/Applications/CONTENTSERV/htdocs/trunk/admin/../admin/modules/indesign/server/jsx/run.jsx</scriptFile><scriptArgs><name>script1</name><value><![CDATA[/Applications/CONTENTSERV/htdocs/trunk/admin//modules/indesign/server/jsx/eval.jsx||%0A%20%20%20%20%20%20%20%20var%20checkPlugin%20%3D%20true%3B%0A%20%20%20%20%20%20%20%20var%20obj%20%3D%20%7B%22version%22%20%3A%20parseFloat%28app.version%29%2C%20%22versionString%22%20%3A%20app.version%7D%3B%0A%20%20%20%20%20%20%20%20try%20%7B%0A%20%20%20%20%20%20%20%20%20%20var%20sVersion%20%3D%20app.comet.about%28%29%3B%0A%20%20%20%20%20%20%20%20%20%20var%20aParts%20%3D%20sVersion.split%28%22%5Cn%22%29%3B%0A%20%20%20%20%20%20%20%20%20%20obj.comet%20%3D%20aParts%5B0%5D%20%2B%20%22%20%22%20%2B%20aParts%5B1%5D%3B%0A%20%20%20%20%20%20%20%20%7D%0A%20%20%20%20%20%20%20%20catch%28e%29%20%7B%7D%0A%20%20%20%20%20%20%20%20if%28%21CSFileUtils.ReadFile%28getGlobalCacheFolder%28%29%20%2B%20%22%2Fb39bd3f40a330f9f45d8b6fe4a685f7b.txt%22%29%29%20%7B%0A%20%20%20%20%20%20%20%20%20%20obj.available%20%3D%20false%3B%0A%20%20%20%20%20%20%20%20%20%20obj.errorNumber%20%3D%20-3%3B%0A%20%20%20%20%20%20%20%20%20%20obj.errorText%20%3D%20%22Admin%20directory%20is%20not%20configured%20correctly%22%3B%0A%20%20%20%20%20%20%20%20%7D%0A%20%20%20%20%20%20%20%20else%7B%0A%20%20%20%20%20%20%20%20%20%20if%28checkPlugin%29%7B%0A%20%20%20%20%20%20%20%20%20%20%20%20doc%20%3D%20app.documents.add%28%29%3B%0A%20%20%20%20%20%20%20%20%20%20%20%20var%20pageID%20%3D%20doc.pages.firstItem%28%29.id.toString%28%29%3B%0A%20%20%20%20%20%20%20%20%20%20%20%20var%20name%20%3D%20%22page%2F%7BPAGEID%7D%2F%7BPAGEID%7D.72.0.low.jpg%22%3B%0A%20%20%20%20%20%20%20%20%20%20%20%20name%20%3D%20name.replace%28%2F%5C%7BPAGEID%5C%7D%2Fg%2C%20pageID%29%3B%0A%20%20%20%20%20%20%20%20%20%20%20%20try%7B%0A%20%20%20%20%20%20%20%20%20%20%20%20%20%20doc.getJpg%28getGlobalCacheFolder%28%29%20%2B%20%22%2F37d00%22%2C%20pageID%2C%2072%2C%20false%2C%20%22%22%2C%20%22_low%22%29%3B%0A%20%20%20%20%20%20%20%20%20%20%20%20%20%20if%28%21CSFileUtils.ReadFile%28getGlobalCacheFolder%28%29%20%2B%20%22%2F37d00%2F%22%20%2B%20name%29%29%20%7B%0A%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20obj.available%20%3D%20false%3B%0A%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20obj.errorNumber%20%3D%20-6%3B%0A%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20obj.errorText%20%3D%20%22Wrong%20version%20of%20the%20CONTENTSERV%20image%20export%20plugin%20is%20installed%22%3B%0A%20%20%20%20%20%20%20%20%20%20%20%20%20%20%7D%0A%20%20%20%20%20%20%20%20%20%20%20%20%20%20else%20%7B%0A%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20obj.available%20%3D%20true%3B%0A%20%20%20%20%20%20%20%20%20%20%20%20%20%20%7D%0A%20%20%20%20%20%20%20%20%20%20%20%20%20%20CSFileUtils.DeleteFolder%28Folder%28getGlobalCacheFolder%28%29%20%2B%20%22%2F37d00%2F%22%29%29%3B%0A%20%20%20%20%20%20%20%20%20%20%20%20%7D%0A%20%20%20%20%20%20%20%20%20%20%20%20catch%28e%29%7B%0A%20%20%20%20%20%20%20%20%20%20%20%20%20%20obj.available%20%3D%20false%3B%0A%20%20%20%20%20%20%20%20%20%20%20%20%20%20obj.errorNumber%20%3D%20-5%3B%0A%20%20%20%20%20%20%20%20%20%20%20%20%20%20obj.errorText%20%3D%20%22CONTENTSERV%20image%20export%20plugin%20is%20not%20installed%20correctly%22%3B%0A%20%20%20%20%20%20%20%20%20%20%20%20%7D%0A%20%20%20%20%20%20%20%20%20%20%20%20doc.close%28%29%3B%0A%20%20%20%20%20%20%20%20%20%20%7D%0A%20%20%20%20%20%20%20%20%20%20else%20%7B%0A%20%20%20%20%20%20%20%20%20%20%20%20obj.available%20%3D%20true%3B%0A%20%20%20%20%20%20%20%20%20%20%7D%0A%20%20%20%20%20%20%20%20%7D%0A%20%20%20%20%20%20%20%20obj.toJSONString%28%29%3B%0A%20%20%20%20%20%20]]></value></scriptArgs><scriptArgs><name>visibleObjects</name><value><![CDATA[textframe;image;note;rectangle;group;polygon;oval]]></value></scriptArgs><scriptArgs><name>projectCacheDir</name><value><![CDATA[/Applications/CONTENTSERV/htdocs/trunk/admin//../CSLive/data//cache/indesign//]]></value></scriptArgs><scriptArgs><name>globalCacheDir</name><value><![CDATA[/Applications/CONTENTSERV/htdocs/trunk/admin//../CSLive/data//cache/indesign]]></value></scriptArgs><scriptArgs><name>CurrentConnectionIndex</name><value><![CDATA[0]]></value></scriptArgs><scriptArgs><name>CurrentAdminPath</name><value><![CDATA[/Applications/CONTENTSERV/htdocs/trunk/admin/]]></value></scriptArgs><scriptArgs><name>CurrentProjectPath</name><value><![CDATA[/Applications/CONTENTSERV/htdocs/trunk/CSLive]]></value></scriptArgs><scriptArgs><name>CurrentMamID</name><value><![CDATA[]]></value></scriptArgs><scriptArgs><name>CurrentUserID</name><value><![CDATA[2]]></value></scriptArgs><scriptArgs><name>CurrentSessionContext</name><value><![CDATA[]]></value></scriptArgs><scriptArgs><name>CurrentProcessID</name><value><![CDATA[noprocessid]]></value></scriptArgs><scriptArgs><name>CurrentView</name><value><![CDATA[page]]></value></scriptArgs><scriptArgs><name>ServerTextLinkType</name><value><![CDATA[]]></value></scriptArgs><scriptArgs><name>IgnoreObjectVisibility</name><value><![CDATA[]]></value></scriptArgs><scriptArgs><name>cacheDeactivated</name><value><![CDATA[]]></value></scriptArgs><scriptArgs><name>memcached</name><value><![CDATA[]]></value></scriptArgs><scriptArgs><name>redis</name><value><![CDATA[]]></value></scriptArgs><scriptArgs><name>documentLocked</name><value><![CDATA[1]]></value></scriptArgs><scriptArgs><name>SoapPort</name><value><![CDATA[8080]]></value></scriptArgs></runScriptParameters></IDSP:RunScript></SOAP-ENV:Body></SOAP-ENV:Envelope>
DefaultInDesignLoadBalancerImpl.processSimpleXMLRequest() <?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:IDSP="http://ns.adobe.com/InDesign/soap/"><SOAP-ENV:Body><IDSP:RunScriptResponse><errorNumber>0</errorNumber><scriptResult><data xsi:type="xsd:string">evaluated%3D%7B%22version%22%3A7.5%2C%22versionString%22%3A%227.5.0.142%22%2C%22available%22%3Atrue%7D%7Cdurations%3D%7B%22CSFileUtils%22%3A%22innerDuration--equal--'6'%20called--equal--'2'%20%22%7D|</data></scriptResult></IDSP:RunScriptResponse></SOAP-ENV:Body></SOAP-ENV:Envelope>
